import richdoc from 'richdoc';
import csInterconvertHtml, { cells2Html } from '../utils/changeset/cs_interconvert_html';
import csToActions from '../utils/changeset/cs_to_actions';

const fakeData = {
  'NNYwPLxRjGAxDSUi': {
    content: '[[30,[{"E10":[40,[[20,"dada"]],"1:32|8:1"],"C7":[40,[[20,"da‘"]],"1:11|8:1"],"D7":[40,[],"1:11|8:1"],"E7":[40,[],"1:11|8:1"],"F7":[40,[],"1:11|8:1"],"G7":[40,[],"1:11|8:1"],"C8":[40,[[20,"f"]],"1:11|8:1"],"D8":[40,[],"1:11|8:1"],"E8":[40,[],"1:11|8:1"],"F8":[40,[],"1:11|8:1"],"G8":[40,[],"1:11|8:1"],"C9":[40,[],"1:11|8:1"],"D9":[40,[],"1:11|8:1"],"E9":[40,[],"1:11|8:1"],"F9":[40,[],"1:11|8:1"],"G9":[40,[],"1:11|8:1"],"C10":[40,[],"1:11|8:1"],"D10":[40,[],"1:11|8:1"],"F10":[40,[],"1:11|8:1"],"G10":[40,[],"1:11|8:1"],"C11":[40,[],"1:11|8:1"],"D11":[40,[],"1:11|8:1"],"E11":[40,[],"1:11|8:1"],"F11":[40,[],"1:11|8:1"],"G11":[40,[],"1:11|8:1"],"C12":[40,[],"1:11|8:1"],"D12":[40,[],"1:11|8:1"],"E12":[40,[],"1:11|8:1"],"F12":[40,[],"1:11|8:1"],"G12":[40,[],"1:11|8:1"],"C13":[40,[],"1:11|8:1"],"D13":[40,[],"1:11|8:1"],"E13":[40,[],"1:11|8:1"],"F13":[40,[],"1:11|8:1"],"G13":[40,[],"1:11|8:1"],"C14":[40,[],"1:11|8:1"],"D14":[40,[],"1:11|8:1"],"E14":[40,[],"1:11|8:1"],"F14":[40,[],"1:11|8:1"],"G14":[40,[],"1:11|8:1"],"C15":[40,[],"1:11|8:1"],"D15":[40,[],"1:11|8:1"],"E15":[40,[],"1:11|8:1"],"F15":[40,[],"1:11|8:1"],"G15":[40,[],"1:11|8:1"],"C16":[40,[],"1:11|8:1"],"D16":[40,[],"1:11|8:1"],"E16":[40,[],"1:11|8:1"],"F16":[40,[],"1:11|8:1"],"G16":[40,[],"1:11|8:1"],"C17":[40,[],"1:11|8:1"],"D17":[40,[[20,"jkdaj&amp;nbsp;"]],"1:11|8:1"],"E17":[40,[[20,"就等哈空间好看法啊飞飞框架錒喝咖啡咖啡卡饭啊"]],"1:11|8:1"],"F17":[40,[],"1:11|8:1"],"G17":[40,[],"1:11|8:1"],"C18":[40,[],"1:11|8:1"],"D18":[40,[[20,"打卡机a"]],"1:11|8:1"],"E18":[40,[],"1:11|8:1"],"F18":[40,[],"1:11|8:1"],"G18":[40,[],"1:11|8:1"],"C19":[40,[],"1:11|8:1"],"D19":[40,[[20,"dadada"]],"1:11|8:1"],"E19":[40,[],"1:11|8:1"],"F19":[40,[],"1:11|8:1"],"G19":[40,[],"1:11|8:1"],"B5":[40,[[20,"大等哈就好的哈就fda"]],"1:32"],"C194":[40,[],"1:18"],"D194":[40,[],"1:18"],"E194":[40,[],"1:18"],"F194":[40,[],"1:18"],"G194":[40,[],"1:18"],"C195":[40,[],"1:18"],"D195":[40,[],"1:18"],"E195":[40,[],"1:18"],"F195":[40,[],"1:18"],"G195":[40,[],"1:18"],"C196":[40,[],"1:18"],"D196":[40,[],"1:18"],"E196":[40,[],"1:18"],"F196":[40,[],"1:18"],"G196":[40,[],"1:18"],"C197":[40,[],"1:18"],"D197":[40,[[20,"看见大卡肯德基大"]],"1:18"],"E197":[40,[],"1:18"],"F197":[40,[],"1:18"],"G197":[40,[],"1:18"],"C198":[40,[],"1:18"],"D198":[40,[],"1:18"],"E198":[40,[],"1:18"],"F198":[40,[],"1:18"],"G198":[40,[],"1:18"],"C199":[40,[],"1:18"],"D199":[40,[],"1:18"],"E199":[40,[],"1:18"],"F199":[40,[],"1:18"],"G199":[40,[],"1:18"],"C200":[40,[],"1:18"],"D200":[40,[],"1:18"],"E200":[40,[[20,"打发回家翻翻fa"]],"1:18|8:1"],"F200":[40,[],"1:18"],"G200":[40,[],"1:18"],"C201":[40,[],"1:18"],"D201":[40,[],"1:18"],"E201":[40,[],"1:18"],"F201":[40,[],"1:18"],"G201":[40,[],"1:18"],"C202":[40,[],"1:18"],"D202":[40,[],"1:18"],"E202":[40,[],"1:18"],"F202":[40,[],"1:18"],"G202":[40,[[20,"大家好假啊好风景发放 啊f"]],"1:18|8:1|9:1"],"C203":[40,[],"1:18"],"D203":[40,[[20,"大家饭后减肥哈佛分a"]],"1:18"],"E203":[40,[],"1:18"],"F203":[40,[],"1:18"],"G203":[40,[],"1:18"],"C204":[40,[],"1:18"],"D204":[40,[],"1:18"],"E204":[40,[],"1:18"],"F204":[40,[],"1:18"],"G204":[40,[],"1:18"],"C205":[40,[],"1:18"],"D205":[40,[],"1:18"],"E205":[40,[],"1:18"],"F205":[40,[],"1:18"],"G205":[40,[],"1:18"],"C206":[40,[],"1:18"],"D206":[40,[],"1:18"],"E206":[40,[],"1:18"],"F206":[40,[],"1:18"],"G206":[40,[],"1:18"],"C207":[40,[[20,"啥叫差距大坏蛋啊da"]],"0:1|1:18"],"D207":[40,[],"1:18"],"E207":[40,[],"1:18"],"F207":[40,[],"1:18"],"G207":[40,[],"1:18"],"C208":[40,[[20,"da"]],"1:18"],"D208":[40,[],"1:18"],"E208":[40,[],"1:18"],"F208":[40,[],"1:18"],"G208":[40,[],"1:18"],"E41":[40,[[20,"大家好假啊好风景发放 啊f"]],"1:32|8:1|9:1"],"C39":[40,[[20,"打发回家翻翻fa"]],"1:31|8:1"],"B29":[40,[[20,"啥叫差距大坏蛋啊da"]],"0:1|1:29"],"B190":[40,[[20,"的假啊好风景阿富汗警方阿富汗发哈减肥阿富汗反封建啊发觉a"]]],"C170":[40,[[20,"大话减肥哈发互粉就发货发fa"]]],"C96":[40,[[20,"大就会发觉发觉互粉就发货发觉 fa"]]],"C76":[40,[[20,"大就会发觉发互粉就发互粉结婚放假啊好饭减肥哈"]]],"E73":[40,[[20,"等哈就发货就阿富汗警方啊减肥后就发货f"]]],"B70":[40,[[20,"大就会发觉发互粉发啊减肥fa"]]],"E58":[40,[[20,"等哈就好饭发互粉发f"]]],"B57":[40,[[20,"和大家饭后就啊飞发货f"]]],"D54":[40,[[20,"打火机回复就阿富汗警方af"]]],"C52":[40,[[20,"大家好的就会发觉复合肥阿富汗"]]],"B42":[40,[[20,"大家饭后减肥哈佛分a"]]],"B36":[40,[[20,"看见大卡肯德基大"]]],"B31":[40,[[20,"a大看见大卡房间发"]]],"B30":[40,[[20,"da"]]],"D20":[40,[[20,"daddadad"]]],"B6":[40,[[20,"da"]]],"B4":[40,[[20,"da"]]],"B3":[40,[[20,"恶事"]]],"D190":[40,[[20,"啥叫差距大坏蛋啊da"]],"0:1|1:29"],"D191":[40,[[20,"da"]]],"D192":[40,[[20,"a大看见大卡房间发"]]],"C209":[40,[[20,"a大看见大卡房间发"]]],"C214":[40,[[20,"看见大卡肯德基大"]]],"D217":[40,[[20,"打发回家翻翻fa"]],"1:31|8:1"],"F219":[40,[[20,"大家好假啊好风景发放 啊f"]],"1:32|8:1|9:1"],"C220":[40,[[20,"大家饭后减肥哈佛分a"]]],"H212":[40,[[20,"啥叫差距大坏蛋啊da"]],"0:1|1:29"],"H213":[40,[[20,"da"]]],"H214":[40,[[20,"a大看见大卡房间发"]]],"H219":[40,[[20,"看见大卡肯德基大"]]],"I222":[40,[[20,"打发回家翻翻fa"]],"1:31|8:1"],"K224":[40,[[20,"大家好假啊好风景发放 啊f"]],"1:32|8:1|9:1"],"H225":[40,[[20,"大家饭后减肥哈佛分a"]]]},[[10,228]],[[10,18]]]]]'
  }
}

export function getSpreadsheetByGuid(guid) {
  return Promise.resolve(fakeData[guid]);
}

/**
 * 将TableOperator转成对应的action，用于渲染
 * @param  {[type]} tableOps [description]
 * @return {[type]}          [description]
 */
export function processTableOps(tableOps){
  var rows, cols, cells, mergeCells, tableActions,
    cellItem, tableDelta;

  tableDelta = tableOps.data;

  //table ops
  tableActions = csToActions.tableOps2Actions(tableOps);

  rows = processRow(tableDelta['rows'].ops);
  cols = processRow(tableDelta['cols'].ops);

  //cells ops
  cellItem = tableDelta.cells;
  cells = processCell(cellItem, rows, cols);
  mergeCells = csInterconvertHtml.getMergeCells(cellItem);

  return {
    table: tableActions,
    rows: rows,
    cols: cols,
    cells: {
      data: cells.cellsData,
      cell: cells.cellsProps,
      mergeCells: mergeCells
    }
  };
}


/**
 * 根据rows的ops, 生成带attr的array，其中
 * @param  {[array]} ops [description]
 * @return {[array]}     [description]
 */
export function processRow(ops){
  var rows = [],
    op, data, attrs;

  //根据ops生成相应数量的attr的数组
  function _genRows(len, attrs){
    var _rows = new Array(len);

    return _.map(_rows, function(item){
      return attrs;
    });
  }

  for(var i=0,l=ops.length; i<l; i++){
    op = ops[i];
    data = parseInt(op.data);
    attrs = op.getAttributes() || {};
    rows = rows.concat(_genRows(data, attrs));
  }
  return rows;
}


export function processCell(cells, rows, cols){
  var cellsData = [],  //for handsontable render
    cellsProps = [],
    rowsLen = rows.length || 20,
    colsLen = cols.length || 18,
    processedCellAttrs;

  for(var i=0; i<rowsLen; i++){
    cellsData[i] = new Array(colsLen);
    for(var j=0; j<colsLen; j++){
      cellsData[i][j] = '';
    }
  }

  cells.forEach(function (cellPosition) {
    var item = cells.get(cellPosition);
    var rowColNum = richdoc.parsePosition(cellPosition);
    var keyRow = rowColNum.row;//数组从0开始
    var keyCol = rowColNum.col;
    var cellPropItem = { row: keyRow, col: keyCol };

    processedCellAttrs = csInterconvertHtml.processCellAttrs(item);
    cellPropItem = _.assign(cellPropItem, processedCellAttrs);
    if(item.getAttributes() && item.getAttributes().formula){
      cellPropItem.type = 'formula';
    }
    if (cellsData[keyRow] && keyCol < colsLen) {
      cellsData[keyRow][keyCol] = cells2Html(item);
      cellsProps.push(cellPropItem);
    } else {
      console.error(cellPosition)
    }
  });

  return {
    cellsData: cellsData,
    cellsProps: cellsProps
  };
}